{
  "header": {
    "nav": {
      "home": "Home",
      "biography": "Biographies",
      "fundamentals": "CS Fundamentals",
      "chronology": "Chronology",
      "quiz": "Quiz",
      "idioms": "Languages",
      "acessibility": "Acessibility",
      "search": "Search"
    }
  },
  
  "languages": {
      "english": "English",
      "portuguese": "Portuguese"
  },

  "periods": {
    "preHistoric": "Pre-History",
    "preInitialMecanic": "Pre-Initial Mechanics",
    "initialMechanics": "Inicial Mechanics",
    "mediumMecanic": "Intermediate Mechanics"
  },

  "others": "Others",

  "levels": {
    "beginner": "Beginner",
    "intermediate": "Intermediate",
    "advanced": "Advanced"
  },

  "home": {
    "banner": {
      "title": "Home",
      "subtitle": "Where the history of computing comes to life since the first calculation."
      },
    "conhecanos": {
      "title": "About us",
      "text": "OldToCode is a portal dedicated to exploring the origins of computing, taking the reader on a historical journey that begins in the prehistoric era, with the first forms of counting and recording, and extends to the emergence of mechanical calculators. Our goal is to present, in a clear and documented manner, how logical thinking and calculating instruments evolved over the centuries, revealing the technological and conceptual foundations that paved the way for the digital age. By retracing this journey, we aim to offer a solid understanding of the importance of these innovations and their role in shaping the modern world.",
      "textShort": "OldToCode is a portal that explores the origins of computing, from the earliest forms of counting to mechanical calculators. Our goal is to clearly show how logical thinking and calculation tools evolved, revealing the foundations that led to the digital age.",
      "devButton": "Developers"
    },

    "highlights": {
      "silogism": {
        "title": "Syllogism and Aristotle's Logic"
      },
      "algorithms": {
        "title": "Algorithms and their logical construction"
      },
      "calculator": {
        "title": "Mechanical Calculators: The beginning of a new era"
      },
      "pascalina": {
        "title": "Pascaline: The beginning, construction and purpose"
      }
    },
    "destaques": {
      "title": "Highlights"
    },


    "biography": {
      "title": "Biographies"
    },

    "logicFundamentals": {
      "title": "Logic Fundamentals",
      "logic": {
        "title": "Logic Foundation",
        "description": "Understand how logic computing works!"
      },
      "data": {
        "title": "Data Structures"
      },
      "algorithms": {
        "title": "Algorithms",
        "description": "Discover where today's algorithms come from."
      }
    },
    "chronology": {
      "title": "Chronology",
      "preHistoric": {
        "title": "Prehistory",
        "subtitle": "| 20,000 to 125 B.C."
      },
      "preInitialMechanic": {
        "title": "Pre-Initial Mechanics",
        "subtitle": "| 126 B.C. to 1617 A.D."
      },
      "initialMechanic": {
        "title": "Initial Mechanics",
        "subtitle": "| 1618 A.D. to 1679 A.D."
      },
      "mediumMechanic": {
        "title": "Intermediate Mechanics",
        "subtitle": "| 1680 A.D. to 1820 A.D."
      }
    }



  },



  "conteudo": {
    "silogismo": {
      "title": "Syllogism and Aristotle's Logic"
    },
    "naoEncontrado": "Content not found",
    "algoritmos": {
      "title": "Algorithms and their Logical Construction"
    },
    "calculadoras": {
      "title": "Mechanical Calculators: The Beginning of a New Era"
    },
    "pascalina": {
      "title": "Pascaline: Origin, Construction, and Purpose"
    }
  },
  
  "quizes": {
  "title": "Quizzes",
  "logicFundamentals": {
    "title": "Logical Fundamentals",
    "description": "This Logic Fundamentals in Computing quiz was designed to test your knowledge of fundamental concepts such as propositions, logical operators, truth tables, equivalences, and deductive reasoning. The goal is to review in a practical and interactive way the principles that support programming and computer operations, encouraging learning and knowledge retention."
  },
  "dataStructures": {
    "title": "Data Structures",
    "description": "This Data Representation and Structures quiz was designed to test your knowledge of essential concepts such as data types, information organization, lists, stacks, queues, and trees. The goal is to review in a practical and interactive way how data is structured and manipulated in computing, stimulating logical reasoning and understanding of the mechanisms that make programs more efficient and functional."
  },
  "algorithms": {
    "title": "Algorithms",
    "description": "This Algorithms quiz was designed to test your knowledge of fundamental concepts such as instruction sequences, control structures, recursion, sorting, and searching. The goal is to review in a practical and interactive way how algorithms guide the functioning of programs and solve everyday problems, stimulating logical thinking and the ability to transform ideas into computational solutions."
  },
  "personalitys": {
    "title": "Personalities",
    "description": "This Computing Personalities quiz was designed to test your knowledge of the biographies and contributions of important figures who shaped the history of technology. The goal is to review in a practical and interactive way how thinkers, mathematicians, inventors, and scientists helped build the foundations of computing, inspiring new generations and showing the relevance of the human role in technological advancement."
  },
  "curiositys": {
    "title": "Curiosities",
    "description": "This Computing Curiosities quiz was designed to test your knowledge of unusual facts, surprising discoveries, and little-known details from the history of technology. The goal is to review in a practical and interactive way events that show the fun and unexpected side of computing, making learning lighter, more stimulating, and memorable."
  },
  "quizDetail": {
    "notFound": "Quiz not found!",
    "learnMore": "You can learn more about",
    "here": "here",
    "startQuiz": "Start Quiz"
  },
  "quiz": {
    "score": "Score",
    "loading": "Loading quiz...",
    "comingSoon": "Quiz coming soon!",
    "noQuestions": "The questions for this quiz are not ready yet.",
    "result": "Result:",
    "quizFinished": "Quiz Finished!",
    "yourScore": "You got {{score}} out of {{total}} questions right.",
    "tryAgain": "Try Again",
    "seeOtherQuizzes": "See other quizzes",
    "question": "Question {{current}} of {{total}}",
    "nextQuestion": "Next Question",
    "finish": "Finish"
  }
}

}