{
  "header": {
    "nav": {
      "home": "Inicio",
      "biography": "Biografias",
      "fundamentals": "Fundamentos CS",
      "chronology": "Cronologia",
      "quiz": "Quiz",
      "idioms": "Idiomas",
      "acessibility": "Acessibilidade",
      "search": "Busca"
    }
  },

  "periods": {
    "preHistoric": "Pré-história",
    "preInitialMecanic": "Pré-mecânica Inicial",
    "initialMechanics": "Mecânica Inicial",
    "mediumMechanics": "Mecânica Intermediária"
  },

  "others": "Outros",

  "levels": {
    "beginner": "Iniciante",
    "intermediate": "Intermediário",
    "advanced": "Avançado"
  },
  
  "home": {
    "banner": {
      "title": "Inicio",
      "subtitle": "Onde a história da computação ganha vida desde o primeiro cálculo."
    },
    "conhecanos": {
      "title": "Conheça-nos",
      "text": "A OldToCode é um portal dedicado a explorar as origens da computação, conduzindo o leitor em uma jornada histórica que se inicia na era pré-histórica, com as primeiras formas de contagem e registro, e se estende até o surgimento das calculadoras mecânicas. Nosso objetivo é apresentar, de forma clara e documentada, como o pensamento lógico e os instrumentos de cálculo evoluíram ao longo dos séculos, revelando as bases tecnológicas e conceituais que pavimentaram o caminho para a era digital. Ao resgatar esse percurso, buscamos oferecer uma compreensão sólida sobre a importância dessas inovações e seu papel na formação do mundo moderno.",
      "devButton": "Desenvolvedores",
      "textShort": "A OldToCode é um portal que explora as origens da computação, desde as primeiras formas de contagem até as calculadoras mecânicas. Nosso objetivo é mostrar, de forma clara, como o pensamento lógico e os instrumentos de cálculo evoluíram, revelando as bases que levaram à era digital."
    },
    "biography": {
      "title": "Biografias"
    },
    "highlights": {
      "silogism": {
        "title": "Silogismo e Lógica de Aristóteles"
      },
      "algorithms": {
        "title": "Algoritimo e sua contrução lógica"
      },
      "calculator": {
        "title": "Calculadoras Mecânicas: O inicio de uma nova era"
      },
      "pascalina": {
        "title": "Pascalina: o seu inicio, contrução e objetivo"
      },
      "arithmometer": {
        "title": "Arithmometer",
        "period": "Mecânica Intermediária",
        "topic": "Ferramentas"
      },
      "tear": {
        "title": "Tear",
        "period": "Mecânica Intermediária",
        "topic": "Ferramentas"
      },
      "binario": {
        "title": "Binario",
        "period": "Mecânica Inicial",
        "topic": "Dados"
      },
      "astrolabio": {
        "title": "Astrolábio Planisférico",
        "period": "Pré-história",
        "topic": "Ferramentas"
      }
    },
    "destaques": {
      "title": "Destaques"
    },
    "logicFundamentals": {
      "title": "Fundamentos Lógicos",
      "logic": {
        "title": "Lógica",
        "description": "Entenda como a logica computacional funciona!"
      },
      "data": {
        "title": "Dados"
      },
      "algorithms": {
        "title": "Algoritmos",
        "description": "Descubra da onde os algoritimos atuais vem."
      }
    },
    "chronology": {
      "title": "Cronologia",
      "preHistoric": {
        "title": "Pré-História",
        "subtitle": "| 20.000 até 125 a.C"
        },
      "preInitialMechanic": {
          "title": "Pré-mecânica Inicial",
          "subtitle": "| 126 a.C até 1617 d.C"
        },
      "initialMechanic": {
          "title": "Mecânica Inicial",
          "subtitle": "| 1618 d.C até 1679 d.C"
        },
      "mediumMechanic": {
          "title": "Mecânica Intermediária",
          "subtitle": "| 1680 d.C até 1820 d.C"
        }
      }
  },

  "biography": {
    "title": "Biografias",
    "khwarizm": {
      "title": "Al-Khwarizmi",
      "p1": {
        "title": "Contexto Histórico",
        "text": "Muhammad ibn Musa al-Khwarizmi nasceu por volta de 780 d.C., na região da Pérsia (atual Uzbequistão), e viveu durante a chamada Era de Ouro Islâmica. Nesse período, Bagdá se tornou um dos maiores centros intelectuais do mundo, reunindo estudiosos de diferentes áreas do conhecimento. Foi nesse ambiente que Al-Khwarizmi trabalhou, especialmente na Casa da Sabedoria, instituição dedicada à tradução e ao desenvolvimento de textos científicos da Grécia, da Índia e de outras culturas."
      },
      "p2": {
        "title": "Contribuições para a Matemática",
        "text": "Al-Khwarizmi é frequentemente referido como o 'pai da álgebra'. Seu livro mais famoso, 'Kitab al-Jabr wa-l-Muqabala' (O Livro da Restauração e da Redução), é onde o termo 'álgebra' se origina. Nesse trabalho, ele sistematizou métodos para resolver equações lineares e quadráticas, introduzindo conceitos que são fundamentais na matemática moderna. Além disso, Al-Khwarizmi desempenhou um papel crucial na introdução do sistema de numeração indo-arábico no mundo islâmico e, posteriormente, na Europa. Seu trabalho sobre aritmética ajudou a popularizar o uso dos números 0-9, que substituíram os sistemas de numeração romanos e outros sistemas menos eficientes.",
        "text2": "Além disso, seu próprio nome deu origem à palavra algoritmo, usada para designar sequências de passos lógicos que permitem resolver problemas. Esse conceito é fundamental não apenas para a matemática, mas também para a ciência da computação moderna."
      }
    },
    "marie": {
      "banner_text": "A pioneira da radioatividade e única pessoa a ganhar o Prêmio Nobel em duas ciências diferentes.",
      "p1": {
        "title": "Primeiros Anos e Educação",
        "text": "Maria Skłodowska-Curie, mais conhecida como Marie Curie, nasceu em 7 de novembro de 1867, em Varsóvia, Polônia. Desde cedo, demonstrou uma inteligência notável e uma paixão pelo conhecimento. Em uma época em que as mulheres eram impedidas de frequentar universidades na Polônia, Marie e sua irmã Bronisława ingressaram na Universidade Flutuante, uma instituição clandestina que oferecia educação superior a jovens polonesas. Mais tarde, Marie mudou-se para Paris para estudar na Sorbonne, onde se destacou em física e matemática."
      },
      "p2": {
        "title": "Descobertas Revolucionárias e Prêmios Nobel",
        "text": "Marie Curie é mundialmente reconhecida por suas pesquisas pioneiras sobre radioatividade. Em colaboração com seu marido, Pierre Curie, ela descobriu dois novos elementos químicos: o polônio (nomeado em homenagem à sua terra natal) e o rádio. Em 1903, Marie e Pierre, juntamente com Henri Becquerel, foram agraciados com o Prêmio Nobel de Física pela descoberta da radioatividade. Após a morte de Pierre, Marie continuou suas pesquisas e, em 1911, recebeu seu segundo Prêmio Nobel, desta vez em Química, pelo isolamento do rádio puro. Ela é a única pessoa na história a ganhar o Prêmio Nobel em duas ciências diferentes.",
        "text2": "Suas descobertas não apenas revolucionaram a física e a química, mas também tiveram um impacto profundo na medicina, com o desenvolvimento de tratamentos para o câncer. Marie Curie faleceu em 4 de julho de 1934, em Passy, França, devido à exposição prolongada à radiação, deixando um legado duradouro para a ciência e para a inspiração de futuras gerações de cientistas."
      }
    },
    "gutenberg": {
      "banner_text": "O inventor da prensa móvel, revolucionando a disseminação do conhecimento.",
      "p1": {
        "title": "A Invenção da Prensa Móvel",
        "text": "Johannes Gutenberg, nascido por volta de 1400 em Mainz, Alemanha, é amplamente reconhecido como o inventor da prensa móvel com tipos metálicos reutilizáveis. Sua inovação, desenvolvida em meados do século XV, revolucionou a produção de livros e a disseminação do conhecimento. Antes de Gutenberg, os livros eram copiados à mão ou impressos usando blocos de madeira gravados, um processo lento e caro."
      },
      "p2": {
        "title": "Impacto e Legado",
        "text": "A invenção de Gutenberg permitiu a produção em massa de textos, tornando os livros mais acessíveis e baratos. A Bíblia de Gutenberg, impressa por volta de 1455, é considerada sua obra-prima e um marco na história da impressão. A prensa móvel teve um impacto profundo na Europa e no mundo, facilitando a Reforma Protestante, o Renascimento e a Revolução Científica. A capacidade de compartilhar ideias e informações de forma rápida e eficiente transformou a educação, a política e a cultura.",
        "text2": "Embora Gutenberg tenha enfrentado dificuldades financeiras e não tenha colhido os frutos de sua invenção em vida, seu legado é inegável. A prensa móvel é considerada uma das invenções mais importantes da história, fundamental para o desenvolvimento da sociedade moderna e para a era da informação."
      }
    },
    "tales": {
      "banner_text": "O primeiro filósofo ocidental e um dos Sete Sábios da Grécia.",
      "p1": {
        "title": "O Início da Filosofia Ocidental",
        "text": "Tales de Mileto, nascido por volta de 624 a.C. em Mileto, na Jônia (atual Turquia), é considerado o primeiro filósofo ocidental e um dos Sete Sábios da Grécia Antiga. Ele marcou a transição do pensamento mítico para o racional, buscando explicações naturais para os fenômenos do mundo, em vez de atribuí-los a divindades. Tales é conhecido por sua teoria de que a água é o princípio fundamental de todas as coisas (arché), uma ideia revolucionária para a época."
      },
      "p2": {
        "title": "Contribuições para a Matemática e Astronomia",
        "text": "Além de suas contribuições filosóficas, Tales também se destacou na matemática e na astronomia. A ele são atribuídos teoremas geométricos, como o Teorema de Tales, que estabelece relações entre triângulos semelhantes. Na astronomia, Tales teria previsto um eclipse solar em 585 a.C., demonstrando um conhecimento avançado dos movimentos celestes. Ele também é creditado por ter calculado a altura das pirâmides do Egito usando a sombra e a proporção, e por ter determinado a distância de navios no mar.",
        "text2": "O legado de Tales de Mileto é imenso, pois ele abriu caminho para o pensamento científico e filosófico que se desenvolveria na Grécia Antiga e influenciaria toda a civilização ocidental. Sua busca por princípios racionais e sua aplicação da razão para entender o universo o tornam uma figura central na história do conhecimento humano."
      }
    },
    "james_watt": {
      "banner_text": "O inventor que impulsionou a Revolução Industrial com a Máquina a Vapor.",
      
      "p1": {
          "title": "A Máquina a Vapor e a Revolução Industrial",
          "text": "James Watt (1736 – 1819) foi um engenheiro e inventor escocês que desempenhou um papel central na Revolução Industrial. Ele é amplamente lembrado por ter aprimorado a máquina a vapor, tornando-a mais eficiente e prática para uso em fábricas, minas e transportes. Seu trabalho não apenas impulsionou a indústria, mas também mudou profundamente a economia, a sociedade e a tecnologia da época."
      },
      "p2": {
          "title": "Origem da Inovação",
          "text": "Watt nasceu em Greenock, na Escócia, em 1736. Desde cedo demonstrou interesse por mecânica e engenharia, trabalhando inicialmente como fabricante de instrumentos científicos. Foi nesse período que entrou em contato com máquinas a vapor já existentes, mas percebeu que elas desperdiçavam muita energia. Em 1765, Watt desenvolveu uma solução inovadora: o condensador separado, que permitia à máquina a vapor manter a temperatura constante, evitando a perda de calor. Essa melhoria aumentou a eficiência do motor e abriu caminho para sua aplicação em larga escala. Em parceria com o empresário Matthew Boulton, Watt fundou a empresa Boulton & Watt, responsável por disseminar suas máquinas por toda a Inglaterra."
      },
      "p3": {
          "title": "Impacto e Legado Científico",
          "text": "O impacto dessa invenção foi imenso. As fábricas passaram a depender da energia a vapor em vez da força humana, animal ou hidráulica. Isso permitiu maior produção, impulsionou o crescimento das cidades industriais e transformou o modo de vida da população. O motor a vapor de Watt também foi fundamental para o desenvolvimento de locomotivas e navios a vapor, acelerando o transporte de pessoas e mercadorias. Além de sua contribuição técnica, Watt deixou seu nome marcado na história da ciência. Em sua homenagem, a unidade de potência do Sistema Internacional de Unidades (SI) foi batizada de watt (W), reconhecendo sua importância para o progresso humano."
      },
      "p4": {
          "title": "O Pílár da Era Moderna",
          "text": "James Watt faleceu em 1819, mas seu legado permanece vivo. Seu trabalho foi um dos pilares da Revolução Industrial, abrindo caminho para a era moderna e mostrando como a engenhosidade humana pode transformar o mundo."
      }
    }
  },

  "conteudo": {
    "silogismo": {
      "title": "Silogismo e Lógica de Aristóteles"
    },
    "naoEncontrado": "Conteúdo não encontrado",
    "algoritmos": {
      "title": "Algoritmos e sua Construção Lógica"
    },
    "calculadoras": {
      "title": "Calculadoras Mecânicas: O Início de uma Nova Era"
    },
    "pascalina": {
      "title": "Pascalina: Origem, Construção e Finalidade"
    }
  },

  "quizes": {
    "title": "Quizes",
    "logicFundamentals": {
      "title": "Fundamentos Lógicos",
      "description": "Este quiz de Fundamento Lógico na Computação foi elaborado para testar seus conhecimentos sobre conceitos fundamentais, como proposições, operadores lógicos, tabelas-verdade, equivalências e raciocínio dedutivo. A proposta é revisar de forma prática e interativa os princípios que sustentam a programação e o funcionamento dos computadores, estimulando o aprendizado e a fixação dos conteúdos."
      },
    "dataStructures": {
      "title": "Estrutura de Dados",
      "description": "Este quiz de Representação e Estrutura de Dados foi elaborado para testar seus conhecimentos sobre conceitos essenciais, como tipos de dados, organização da informação, listas, pilhas, filas e árvores. A proposta é revisar de forma prática e interativa como os dados são estruturados e manipulados na computação, estimulando o raciocínio lógico e a compreensão dos mecanismos que tornam os programas mais eficientes e funcionais."
    },
    "algorithms": {
      "title": "Algoritmos",
      "description": "Este quiz de Algoritmos foi elaborado para testar seus conhecimentos sobre conceitos fundamentais, como sequências de instruções, estruturas de controle, recursividade, ordenação e busca. A proposta é revisar de forma prática e interativa como os algoritmos orientam o funcionamento dos programas e resolvem problemas do dia a dia, estimulando o pensamento lógico e a habilidade de transformar ideias em soluções computacionais."
    },
    "personalitys": {
      "title": "Personalidades",
      "description": "Este quiz de Personalidades da Computação foi elaborado para testar seus conhecimentos sobre as biografias e contribuições de figuras importantes que marcaram a história da tecnologia. A proposta é revisar de forma prática e interativa como pensadores, matemáticos, inventores e cientistas ajudaram a construir os fundamentos da computação, inspirando novas gerações e mostrando a relevância do papel humano no avanço tecnológico."
    },
    "curiositys": {
      "title": "Curiosidades",
      "description": "Este quiz de Curiosidades da Computação foi elaborado para testar seus conhecimentos sobre fatos inusitados, descobertas surpreendentes e detalhes pouco conhecidos da história da tecnologia. A proposta é revisar de forma prática e interativa acontecimentos que mostram o lado divertido e inesperado da computação, tornando o aprendizado mais leve, estimulante e memorável."
    },
    "quizDetail": {
      "notFound": "Quiz não encontrado!",
      "learnMore": "Você pode saber mais sobre",
      "here": "aqui",
      "startQuiz": "Iniciar Quiz"
    },
    "quiz": {
      "score": "Placar de Acertos",
      "loading": "Carregando quiz...",
      "comingSoon": "Quiz em breve!",
      "noQuestions": "As perguntas para este quiz ainda não estão prontas.",
      "result": "Resultado:",
      "quizFinished": "Quiz Finalizado!",
      "yourScore": "Você acertou {{score}} de {{total}} perguntas.",
      "tryAgain": "Tentar Novamente",
      "seeOtherQuizzes": "Ver outros quizzes",
      "question": "Pergunta {{current}} de {{total}}",
      "nextQuestion": "Próxima Pergunta",
      "finish": "Finalizar"
    }
  },
  
  "search": {
    "title": "Resultados da Pesquisa",
    "query_label": "Exibindo resultados para",
    "items_found": "itens encontrados",
    "no_results": "Não foram encontrados resultados para a sua pesquisa. Tente usar termos mais abrangentes.",
    "no_query": "Utilize a caixa de busca para encontrar conteúdos sobre Biografias, Fundamentos, Cronologia e Quizes.",
    "placeholder": "Pesquisar no site..."
  }
}